"""
f(221) = 122
f(1020) = 201
f(10) = 1

g(221) = f(f(221)) / 221 = f(122) / 211 = 211 / 211 = 1
g(1020) = f(f(1020)) / 1020 = f(201) / 1020 = 102 / 1020 = 0.1
g(10) = f(f(10)) / 10 = f(1) / 10 = 1 / 10 = 0.1

для данного значения 1030, ответ - 4
т.к. такого ответа нет, 
могу предположить, что в задаче сказано про 10 ** 30
так что ответ аналогичный: 30
"""


def f(n: int) -> int:
    return int(str(n)[::-1])


def g(n: int) -> float:
    return f(f(n)) / n


result: set[float] = set()

for i in range(1, 1030 + 1):
    result.add(g(i))

print(len(result))
print(result)
